#ifndef _BACKGROUND_MANAGER_H_
#define _BACKGROUND_MANAGER_H_
//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 背景01
#define TEXTURE_BACKGROUND_01		_T("data/TEXTURE/GameBackground.jpg")			// 読み込むテクスチャファイル名
// サイズ
#define BACKGROUND_01_SIZE_X			(1080)			// 背景01画面(背景)の幅(X)
#define BACKGROUND_01_SIZE_Y			(720)			// 背景01画面(背景)の高さ(Y)
// 背景情報
#define BACKGROUND_01_SCROLL_SPEED	(0.001f)			// タイトル画面(背景)のスクロール



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


#endif