#ifndef _LOSE_H_
#define _LOSE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 背景
#define TEXTURE_LOSE			_T("data/TEXTURE/dogeza.png")			// 読み込むテクスチャファイル名

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLose(int InitType);
void UninitLose(void);
void UpdateLose(void);
void DrawLose(void);


#endif