#include "main.h"
#include "TitleBackground.h"
#include "TitleSelect.h"
#include "TitleManager.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
bool	 TitleManagerDrowFalg;			// 描画フラグ

//=============================================================================
// 初期化処理
//=============================================================================
void InitTitleManager(int InitType)
{
	InitTitleBackground(InitType);	// タイトル画面の初期化処理
	InitTitleSelect(InitType);		// タイトル選択肢の初期化処理

	TitleManagerDrowFalg = true;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitleManager(void)
{
	UninitTitleBackground();			// タイトル画面の終了処理
	UninitTitleSelect();				// タイトル選択肢の終了処理
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitleManager(void)
{
	UpdateTitleBackground();			// タイトル画面の更新処理
	UpdateTitleSelect();				// タイトル選択肢の更新処理
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitleManager(void)
{
	DrawTitleBackground(TitleManagerDrowFalg);			// タイトル画面の描画処理

	if (TitleManagerDrowFalg == true)
	{
		DrawTitleSelect();								// タイトル選択肢の描画処理
	}
}

//=============================================================================
// 描画フラグを取得
//=============================================================================
void SetTitleManagerDrowFalg(bool Flag)
{
	TitleManagerDrowFalg = Flag;
}