#ifndef _WIN_H_
#define _WIN_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// 背景
#define TEXTURE_WIN			_T("data/TEXTURE/win.png")			// 読み込むテクスチャファイル名

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWin(int InitType);
void UninitWin(void);
void UpdateWin(void);
void DrawWin(void);


#endif